constant/box_xmax/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/solid";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    // Iron

    specie
    {
        molWeight       50;
    }
    equationOfState
    {
        rho             7870;  // [kg/m^3] [1 -3 0 0 0 0 0] source COMSOL (ini 8000)
    }
    transport
    {
        kappa           76.2;  // [W/(m*K)] Conductivité thermqiue. source COMSOL 
    }
    thermodynamics
    {
        Hf              0;
        Cp              440;  // [J/(kg*K)] Capacité thermqiue à volume consant/ source COMSOL. Pour solides Cv env. = à Cp
    }
}

// ************************************************************************* //
