0/box_xmax/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"


    bottom
    {
        type            zeroGradient;
    }
    maxX
    {
        type            zeroGradient;
    }
    maxY
    {
        type            zeroGradient;
    }
    minX
    {
        type            zeroGradient;
    }
    minY
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedValue;
        value           uniform 873.15;
    }
    solid_to_water
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        kappaMethod     solidThermo;
        Tnbr            T;
    }
}


// ************************************************************************* //
