system/ZGraph_CoteSortie_Solid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.
\*---------------------------------------------------------------------------*/

start   (0.01 0.05 0.1);
end     (0.01 0.05 0.0);
fields  (T);
region  solid;

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

interpolationScheme cellPoint;

setFormat   csv;


// Override settings here, e.g.

setConfig
{

    nPoints 200;
//    axis    distance;    
    axis    z;    // x, y, z
}


// Must be last entry
#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"

// ************************************************************************* //
